Revit 2024 API
BoundaryConditions.GetOrientTo Method
 Returns the boundary conditions orientation option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public BoundaryConditionsOrientTo GetOrientTo()
Visual Basic
Public Function GetOrientTo As BoundaryConditionsOrientTo
Visual C++
public:
BoundaryConditionsOrientTo GetOrientTo()
Return Value
 The orientation option.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace